text = 'Добрый день, коллеги! Кто сталкивался с обременением квартиры у кооператива БестВей? Фактически собственником квартиры является сам кооператив. Кооператив разваливается, едва на плаву держится. Продавец продает такую квартиру и уже нашелся покупатель. Покупатель мать, действующая от лица своего несовершеннолетнего ребенка. Деньги на квартиру хранятся на детском расчетном счете. Даст ли опека разрешение на покупку такой квартиры и как будут производится расчеты в таком случае?'

if 'покупк' in text:
    print(text)